In [1]:
import pandas as pd

In [2]:
diccionario= {'nombre': ['María', 'Luis', 'Carmen', 'Antonio'],
       'edad': [18, 22, 20, 21],
       'grado': ['Economía', 'Medicina', 'Arquitectura', 'Economía'],
       'correo': ['maria@gmail.com', 'luis@yahoo.es', 'carmen@gmail.com', 'antonio@gmail.com']
       }
       
Lista_de_Listas = [['María', 18],
         ['Luis', 22],
         ['Carmen', 20]]
                  
Lista_diccionario = [{'Nombre': 'María', 'Edad': 18},
         {'Nombre': 'Luis', 'Edad': 22},
         {'Nombre': 'Carmen'}]

In [3]:
print(diccionario)  # también se puedesn generar df con arrays
print(Lista_de_Listas)
print(Lista_diccionario)

{'nombre': ['María', 'Luis', 'Carmen', 'Antonio'], 'edad': [18, 22, 20, 21], 'grado': ['Economía', 'Medicina', 'Arquitectura', 'Economía'], 'correo': ['maria@gmail.com', 'luis@yahoo.es', 'carmen@gmail.com', 'antonio@gmail.com']}
[['María', 18], ['Luis', 22], ['Carmen', 20]]
[{'Nombre': 'María', 'Edad': 18}, {'Nombre': 'Luis', 'Edad': 22}, {'Nombre': 'Carmen'}]

In [4]:
df=pd.DataFrame(diccionario)
df

    nombre  edad         grado             correo
0    María    18      Economía    maria@gmail.com
1     Luis    22      Medicina      luis@yahoo.es
2   Carmen    20  Arquitectura   carmen@gmail.com
3  Antonio    21      Economía  antonio@gmail.com

In [5]:
df=pd.DataFrame(Lista_de_Listas)
df

        0   1
0   María  18
1    Luis  22
2  Carmen  20

In [6]:
df=pd.DataFrame(Lista_diccionario)
df

   Nombre  Edad
0   María  18.0
1    Luis  22.0
2  Carmen   NaN

In [7]:
df=pd.DataFrame(Lista_de_Listas, columns=["Nombre","Edad"])
df

   Nombre  Edad
0   María    18
1    Luis    22
2  Carmen    20

In [8]:
# Desde fuentes read;
#para deescargar y descomprimir: wget https://github.com/ricardoahumada/DataScienceBasics/raw/refs/heads/main/data/data.zip
# unzip data.zip (en el directorio que quiero que de descarge y descomprima)
# pd.read_csv (ruta)

In [9]:
dfcol=pd.read_csv('../Data/colesterol.csv')
print(dfcol)

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [10]:
dfcol=pd.read_csv('https://raw.githubusercontent.com/ricardoahumada/DataScienceBasics/refs/heads/main/data/colesterol.csv')
print (dfcol) #también se puede cargar directamente con url (wget y con raw)

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [11]:
dffr=pd.read_json('../Data/frutas.json')
dffr

       apples  oranges
Luis        3        0
Ana         2        3
Juana       0        7
Pedro       1        2

In [12]:
#squlite es tipo de bbdd; necesitaremos las librerías correspondientes
import sqlite3

In [13]:
con_sqlite=sqlite3.connect('../Data/database.db') #bbdd sencillita;la conexión puede ser una url si está en local
dfdb=pd.read_sql_query("SELECT * FROM movies",con_sqlite)
con_sqlite.close() # es conveniente cerrar la conexión; más importante si es bbdd en un servidor, reduce rendimiento
dfdb

,title,movieId,genres
0,Toy Story (1995),1,Adventure|Animation|Children|Comedy|Fantasy
1,Jumanji (1995),2,Adventure|Children|Fantasy
2,Grumpier Old Men (1995),3,Comedy|Romance
3,Waiting to Exhale (1995),4,Comedy|Drama|Romance
4,Father of the Bride Part II (1995),5,Comedy
...,...,...,...
9737,Black Butler: Book of the Atlantic (2017),193581,Action|Animation|Comedy|Fantasy
9738,No Game No Life: Zero (2017),193583,Animation|Comedy|Fantasy
9739,Flint (2017),193585,Drama
9740,Bungo Stray Dogs: Dead Apple (2018),193587,Action|Animation
9741,Andrew Dice Clay: Dice Rules (1991),193609,Comedy

In [14]:
#!pip install openpyxl # necesario para abrir y explorar xls

In [15]:
import openpyxl

In [16]:
dfxls=pd.read_excel('../Data/FoodMarket.xlsx',sheet_name='Purchases') #hay que conocer las hojas
dfxls

      Code  Product  Seller  Buyer      Fecha  Quantity
0        1       15      37     90 2020-11-10        25
1        2       46      32     51 2020-09-19        16
2        3       44      27    166 2019-02-19        25
3        4       52      21     68 2020-06-08        40
4        5       20      21    185 2019-01-18        36
...    ...      ...     ...    ...        ...       ...
1496  1497       10      18    199 2020-11-23        34
1497  1498       63      58     38 2020-03-13        35
1498  1499       28       5     81 2020-03-02        31
1499  1500       21       2    194 2021-02-18        35
1500  1501       33       8    120 2020-03-13        12

[1501 rows x 6 columns]

In [17]:
#Exportar, transformación y guardar como
dfxls.to_csv('../Data/Purchases.csv')

In [18]:
dfxls.to_json('../Data/Purchases.json')

In [19]:
#almacenamiento en bbd; le da error al profe también
con_sqlite=sqlite3.connect('../Data/database.db')
dfxls.to_sql(name="Purchases",con=con_sqlite)

OperationalError: database is locked

In [60]:

# Atributos; explorar datos
dfxls

      Code  Product  Seller  Buyer      Fecha  Quantity
0        1       15      37     90 2020-11-10        25
1        2       46      32     51 2020-09-19        16
2        3       44      27    166 2019-02-19        25
3        4       52      21     68 2020-06-08        40
4        5       20      21    185 2019-01-18        36
...    ...      ...     ...    ...        ...       ...
1496  1497       10      18    199 2020-11-23        34
1497  1498       63      58     38 2020-03-13        35
1498  1499       28       5     81 2020-03-02        31
1499  1500       21       2    194 2021-02-18        35
1500  1501       33       8    120 2020-03-13        12

[1501 rows x 6 columns]

In [61]:
dfxls.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1501 entries, 0 to 1500
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Code      1501 non-null   int64
 1   Product   1501 non-null   int64
 2   Seller    1501 non-null   int64
 3   Buyer     1501 non-null   int64
 4   Fecha     1501 non-null   datetime64[ns]
 5   Quantity  1501 non-null   int64
dtypes: datetime64[ns](1), int64(5)
memory usage: 70.5 KB

In [66]:
dfxls.shape

(1501, 6)

In [65]:
dfcol.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nombre      14 non-null     object
 1   edad        14 non-null     int64
 2   sexo        14 non-null     object
 3   peso        13 non-null     float64
 4   altura      14 non-null     float64
 5   colesterol  13 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 800.0+ bytes

In [63]:
dfcol.size

84

In [64]:
dfcol.shape

(14, 6)

In [71]:
print(dfxls.columns)
print(dfxls.index)
print(dfxls.axes)
print(dfxls.values)

Index(['Code', 'Product', 'Seller', 'Buyer', 'Fecha', 'Quantity'], dtype='object')
RangeIndex(start=0, stop=1501, step=1)
[RangeIndex(start=0, stop=1501, step=1), Index(['Code', 'Product', 'Seller', 'Buyer', 'Fecha', 'Quantity'], dtype='object')]
[[1 15 37 90 Timestamp('2020-11-10 00:00:00') 25]
 [2 46 32 51 Timestamp('2020-09-19 00:00:00') 16]
 [3 44 27 166 Timestamp('2019-02-19 00:00:00') 25]
 ...
 [1499 28 5 81 Timestamp('2020-03-02 00:00:00') 31]
 [1500 21 2 194 Timestamp('2021-02-18 00:00:00') 35]
 [1501 33 8 120 Timestamp('2020-03-13 00:00:00') 12]]

In [40]:
print(dfxls.index)

RangeIndex(start=0, stop=1501, step=1)

In [72]:
print(dfcol.dtypes)

nombre         object
edad            int64
sexo           object
peso          float64
altura        float64
colesterol    float64
dtype: object

In [73]:
dfxls.head()

   Code  Product  Seller  Buyer      Fecha  Quantity
0     1       15      37     90 2020-11-10        25
1     2       46      32     51 2020-09-19        16
2     3       44      27    166 2019-02-19        25
3     4       52      21     68 2020-06-08        40
4     5       20      21    185 2019-01-18        36

In [74]:
dfxls.tail(2)

      Code  Product  Seller  Buyer      Fecha  Quantity
1499  1500       21       2    194 2021-02-18        35
1500  1501       33       8    120 2020-03-13        12

In [75]:
dfxls.describe()

              Code      Product       Seller        Buyer     Quantity
count  1501.000000  1501.000000  1501.000000  1501.000000  1501.000000
mean    751.000000    34.712192    28.788141   104.956696    31.341106
std     433.445691    19.974111    16.557750    59.825625     7.333365
min       1.000000     1.000000     1.000000     1.000000    12.000000
25%     376.000000    17.000000    14.000000    51.000000    26.000000
50%     751.000000    34.000000    28.000000   106.000000    31.000000
75%    1126.000000    52.000000    43.000000   158.000000    37.000000
max    1501.000000    70.000000    58.000000   207.000000    50.000000

In [ ]:
# Renombrar y modificar (índices y columnas)

In [76]:
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [82]:
dfcol.rename(columns={'nombre':'nombre y apellido','peso':'pesos'},index={0:100,10:66}) 
#no se modifica el df original

                   nombre y apellido  edad sexo  pesos  altura  colesterol
100     José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                     Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2              Javier García Sánchez    24    H    NaN    1.81       191.0
3                Carmen López Pinzón    35    M   65.0    1.70       200.0
4               Marisa López Collado    46    M   51.0    1.58       148.0
5                  Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6            Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7              Pilar Martín González    22    M   60.0    1.66         NaN
8               Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9            Santiago Reillo Manzano    46    H   75.0    1.85       280.0
66             Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11        José María de la Guía Sanz    58    H   78.0    1.87       198.0
12   Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13             Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [81]:
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [83]:
dfcol2=dfcol.rename(columns={'nombre':'nombre y apellido','peso':'pesos'},index={0:100,10:66})
dfcol2

                   nombre y apellido  edad sexo  pesos  altura  colesterol
100     José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                     Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2              Javier García Sánchez    24    H    NaN    1.81       191.0
3                Carmen López Pinzón    35    M   65.0    1.70       200.0
4               Marisa López Collado    46    M   51.0    1.58       148.0
5                  Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6            Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7              Pilar Martín González    22    M   60.0    1.66         NaN
8               Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9            Santiago Reillo Manzano    46    H   75.0    1.85       280.0
66             Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11        José María de la Guía Sanz    58    H   78.0    1.87       198.0
12   Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13             Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [84]:
# utilizando inplace

dfcol.rename(columns={'nombre':'nombre y apellido','peso':'pesos'},index={0:100,10:66},inplace=True) 
#se modifica el df original
dfcol

                   nombre y apellido  edad sexo  pesos  altura  colesterol
100     José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                     Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2              Javier García Sánchez    24    H    NaN    1.81       191.0
3                Carmen López Pinzón    35    M   65.0    1.70       200.0
4               Marisa López Collado    46    M   51.0    1.58       148.0
5                  Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6            Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7              Pilar Martín González    22    M   60.0    1.66         NaN
8               Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9            Santiago Reillo Manzano    46    H   75.0    1.85       280.0
66             Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11        José María de la Guía Sanz    58    H   78.0    1.87       198.0
12   Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13             Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [88]:
# Agrupación de datos; por multiindice
dfcol.set_index('nombre y apellido')

                                 edad sexo  pesos  altura  colesterol
nombre y apellido
José Luis Martínez Izquierdo       18    H   85.0    1.79       182.0
Rosa Díaz Díaz                     32    M   65.0    1.73       232.0
Javier García Sánchez              24    H    NaN    1.81       191.0
Carmen López Pinzón                35    M   65.0    1.70       200.0
Marisa López Collado               46    M   51.0    1.58       148.0
Antonio Ruiz Cruz                  68    H   66.0    1.74       249.0
Antonio Fernández Ocaña            51    H   62.0    1.72       276.0
Pilar Martín González              22    M   60.0    1.66         NaN
Pedro Gálvez Tenorio               35    H   90.0    1.94       241.0
Santiago Reillo Manzano            46    H   75.0    1.85       280.0
Macarena Álvarez Luna              53    M   55.0    1.62       262.0
José María de la Guía Sanz         58    H   78.0    1.87       198.0
Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
Carolina Rubio Moreno              20    M   61.0    1.77       194.0

In [89]:
dfcol.reindex()

                   nombre y apellido  edad sexo  pesos  altura  colesterol
100     José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                     Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2              Javier García Sánchez    24    H    NaN    1.81       191.0
3                Carmen López Pinzón    35    M   65.0    1.70       200.0
4               Marisa López Collado    46    M   51.0    1.58       148.0
5                  Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6            Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7              Pilar Martín González    22    M   60.0    1.66         NaN
8               Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9            Santiago Reillo Manzano    46    H   75.0    1.85       280.0
66             Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11        José María de la Guía Sanz    58    H   78.0    1.87       198.0
12   Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13             Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [91]:
dfcol.reindex(index=[4,3,1])

      nombre y apellido  edad sexo  pesos  altura  colesterol
4  Marisa López Collado    46    M   51.0    1.58       148.0
3   Carmen López Pinzón    35    M   65.0    1.70       200.0
1        Rosa Díaz Díaz    32    M   65.0    1.73       232.0

In [93]:
dfcol.reindex(index=[4,3,1], columns=['edad']) # es una especie de filtrado

   edad
4    46
3    35
1    32

In [41]:
#filtrar: usando loc, por posiciones (permite condiciones de filtrado), o por iloc que es por índices
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [61]:
dfcol['altura']

0     1.79
1     1.73
2     1.81
3     1.70
4     1.58
5     1.74
6     1.72
7     1.66
8     1.94
9     1.85
10    1.62
11    1.87
12    1.98
13    1.77
Name: altura, dtype: float64

In [66]:
dfcol[['altura','peso','edad']]

    altura   peso  edad
0     1.79   85.0    18
1     1.73   65.0    32
2     1.81    NaN    24
3     1.70   65.0    35
4     1.58   51.0    46
5     1.74   66.0    68
6     1.72   62.0    51
7     1.66   60.0    22
8     1.94   90.0    35
9     1.85   75.0    46
10    1.62   55.0    53
11    1.87   78.0    58
12    1.98  109.0    27
13    1.77   61.0    20

In [68]:
dfcol.iloc[4,3]

51.0

In [69]:
dfcol.iloc[11,0]

'José María de la Guía Sanz'

In [73]:
dfcol.iloc[11,:3] # fila 11, columnas 0,1 y 2

nombre    José María de la Guía Sanz
edad                              58
sexo                               H
Name: 11, dtype: object

In [75]:
dfcol.iloc[:4,3:] #filas 1, 2 y 3, y columnas desde la 3 hasta el final

   peso  altura  colesterol
0  85.0    1.79       182.0
1  65.0    1.73       232.0
2   NaN    1.81       191.0
3  65.0    1.70       200.0

In [83]:
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [82]:
dfcol.loc[:,'peso']>70 # hay que poner la condición fuera del corchete
# se genera una máscara

0      True
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
10    False
11     True
12     True
13    False
Name: peso, dtype: bool

In [84]:
mask=dfcol.loc[:,'peso']>70 #también se puede hacer máscaras con iloc, pero es más lioso
dfcol[mask]

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0

In [93]:
mask2=dfcol.loc[:,['peso','edad']]>[70,35] #esto pasa por tener dos criterios de búsqueda
print(mask2)
print(dfcol[mask2])

     peso   edad
0    True  False
1   False  False
2   False  False
3   False  False
4   False   True
5   False   True
6   False   True
7   False  False
8    True  False
9    True   True
10  False   True
11   True   True
12   True  False
13  False  False
   nombre  edad sexo   peso  altura  colesterol
0     NaN   NaN  NaN   85.0     NaN         NaN
1     NaN   NaN  NaN    NaN     NaN         NaN
2     NaN   NaN  NaN    NaN     NaN         NaN
3     NaN   NaN  NaN    NaN     NaN         NaN
4     NaN  46.0  NaN    NaN     NaN         NaN
5     NaN  68.0  NaN    NaN     NaN         NaN
6     NaN  51.0  NaN    NaN     NaN         NaN
7     NaN   NaN  NaN    NaN     NaN         NaN
8     NaN   NaN  NaN   90.0     NaN         NaN
9     NaN  46.0  NaN   75.0     NaN         NaN
10    NaN  53.0  NaN    NaN     NaN         NaN
11    NaN  58.0  NaN   78.0     NaN         NaN
12    NaN   NaN  NaN  109.0     NaN         NaN
13    NaN   NaN  NaN    NaN     NaN         NaN

In [86]:
dfcol.loc[1:5,['colesterol','peso']] #con loc se pueden seleccionar por posiciones y nombres de columnas

   colesterol  peso
1       232.0  65.0
2       191.0   NaN
3       200.0  65.0
4       148.0  51.0
5       249.0  66.0

In [87]:
mask=dfcol.isin([20,1.7,'Javier García Sánchez'])
mask

    nombre   edad   sexo   peso  altura  colesterol
0    False  False  False  False   False       False
1    False  False  False  False   False       False
2     True  False  False  False   False       False
3    False  False  False  False    True       False
4    False  False  False  False   False       False
5    False  False  False  False   False       False
6    False  False  False  False   False       False
7    False  False  False  False   False       False
8    False  False  False  False   False       False
9    False  False  False  False   False       False
10   False  False  False  False   False       False
11   False  False  False  False   False       False
12   False  False  False  False   False       False
13   False   True  False  False   False       False

In [88]:
dfcol[mask]

                   nombre  edad sexo  peso  altura  colesterol
0                     NaN   NaN  NaN   NaN     NaN         NaN
1                     NaN   NaN  NaN   NaN     NaN         NaN
2   Javier García Sánchez   NaN  NaN   NaN     NaN         NaN
3                     NaN   NaN  NaN   NaN     1.7         NaN
4                     NaN   NaN  NaN   NaN     NaN         NaN
5                     NaN   NaN  NaN   NaN     NaN         NaN
6                     NaN   NaN  NaN   NaN     NaN         NaN
7                     NaN   NaN  NaN   NaN     NaN         NaN
8                     NaN   NaN  NaN   NaN     NaN         NaN
9                     NaN   NaN  NaN   NaN     NaN         NaN
10                    NaN   NaN  NaN   NaN     NaN         NaN
11                    NaN   NaN  NaN   NaN     NaN         NaN
12                    NaN   NaN  NaN   NaN     NaN         NaN
13                    NaN  20.0  NaN   NaN     NaN         NaN

In [89]:
mask=dfcol.isin({'peso':[75,85]})
mask

    nombre   edad   sexo   peso  altura  colesterol
0    False  False  False   True   False       False
1    False  False  False  False   False       False
2    False  False  False  False   False       False
3    False  False  False  False   False       False
4    False  False  False  False   False       False
5    False  False  False  False   False       False
6    False  False  False  False   False       False
7    False  False  False  False   False       False
8    False  False  False  False   False       False
9    False  False  False   True   False       False
10   False  False  False  False   False       False
11   False  False  False  False   False       False
12   False  False  False  False   False       False
13   False  False  False  False   False       False

In [90]:
mask=dfcol.isin({'peso':[75,85],'edad':[39,56]}) #se cumple alguna de las condiciones
mask

    nombre   edad   sexo   peso  altura  colesterol
0    False  False  False   True   False       False
1    False  False  False  False   False       False
2    False  False  False  False   False       False
3    False  False  False  False   False       False
4    False  False  False  False   False       False
5    False  False  False  False   False       False
6    False  False  False  False   False       False
7    False  False  False  False   False       False
8    False  False  False  False   False       False
9    False  False  False   True   False       False
10   False  False  False  False   False       False
11   False  False  False  False   False       False
12   False  False  False  False   False       False
13   False  False  False  False   False       False

In [91]:
mask= ~dfcol.isin({'peso':[75,85],'edad':[39,56]}) #se cumple alguna de las condiciones
mask

    nombre  edad  sexo   peso  altura  colesterol
0     True  True  True  False    True        True
1     True  True  True   True    True        True
2     True  True  True   True    True        True
3     True  True  True   True    True        True
4     True  True  True   True    True        True
5     True  True  True   True    True        True
6     True  True  True   True    True        True
7     True  True  True   True    True        True
8     True  True  True   True    True        True
9     True  True  True  False    True        True
10    True  True  True   True    True        True
11    True  True  True   True    True        True
12    True  True  True   True    True        True
13    True  True  True   True    True        True

In [92]:
dfcol[mask]

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H    NaN    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H    NaN    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [94]:
dfcol[mask].dropna() #me quita toda fila que contiene al menos un NaN

                             nombre  edad sexo   peso  altura  colesterol
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [21]:
#operaciones columnas
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [23]:
#los elementos textuales son de tipo objeto
dfcol.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   nombre      14 non-null     object
 1   edad        14 non-null     int64
 2   sexo        14 non-null     object
 3   peso        13 non-null     float64
 4   altura      14 non-null     float64
 5   colesterol  13 non-null     float64
dtypes: float64(3), int64(1), object(2)
memory usage: 800.0+ bytes

In [25]:
dfcol['edad'].describe() #se puede hacer a nivel de columna

count    14.000000
mean     38.214286
std      15.621379
min      18.000000
25%      24.750000
50%      35.000000
75%      49.750000
max      68.000000
Name: edad, dtype: float64

In [28]:
print(dfcol['edad'].count())
print(dfcol['edad'].mean())
print(dfcol['edad'].std())

14
38.214285714285715
15.62137870123737

In [29]:
dfcol.describe() #no incluye los datos tipo "objeto"

            edad        peso     altura  colesterol
count  14.000000   13.000000  14.000000   13.000000
mean   38.214286   70.923077   1.768571  220.230769
std    15.621379   16.126901   0.115016   39.847948
min    18.000000   51.000000   1.580000  148.000000
25%    24.750000   61.000000   1.705000  194.000000
50%    35.000000   65.000000   1.755000  210.000000
75%    49.750000   78.000000   1.840000  249.000000
max    68.000000  109.000000   1.980000  280.000000

In [31]:
dfcol.describe(include='object') #describe los datos de tipo objeto; son categóricos como H-M

                              nombre sexo
count                             14   14
unique                            14    2
top     José Luis Martínez Izquierdo    H
freq                               1    8

In [36]:
dfcol.select_dtypes(include=['int64','float64'])

    edad   peso  altura  colesterol
0     18   85.0    1.79       182.0
1     32   65.0    1.73       232.0
2     24    NaN    1.81       191.0
3     35   65.0    1.70       200.0
4     46   51.0    1.58       148.0
5     68   66.0    1.74       249.0
6     51   62.0    1.72       276.0
7     22   60.0    1.66         NaN
8     35   90.0    1.94       241.0
9     46   75.0    1.85       280.0
10    53   55.0    1.62       262.0
11    58   78.0    1.87       198.0
12    27  109.0    1.98       210.0
13    20   61.0    1.77       194.0

In [37]:
dfcol.select_dtypes(include=['object'])

                             nombre sexo
0      José Luis Martínez Izquierdo    H
1                    Rosa Díaz Díaz    M
2             Javier García Sánchez    H
3               Carmen López Pinzón    M
4              Marisa López Collado    M
5                 Antonio Ruiz Cruz    H
6           Antonio Fernández Ocaña    H
7             Pilar Martín González    M
8              Pedro Gálvez Tenorio    H
9           Santiago Reillo Manzano    H
10            Macarena Álvarez Luna    M
11       José María de la Guía Sanz    H
12  Miguel Angel Cuadrado Gutiérrez    H
13            Carolina Rubio Moreno    M

In [ ]:
# Cocatenación de Dataframes

In [32]:
datos = {'nombre': ['María', 'Luis', 'Carmen'],
         'edad': [18, 22, 20],
         'Matemáticas': [8.5, 7, 3.5],
         'Economía': [8, 6.5, 5],
         'Programación': [6.5, 4, 9]}

df=pd.DataFrame(datos)
df

   nombre  edad  Matemáticas  Economía  Programación
0   María    18          8.5       8.0           6.5
1    Luis    22          7.0       6.5           4.0
2  Carmen    20          3.5       5.0           9.0

In [35]:
dfm=df.melt(id_vars=['nombre','edad'],var_name="Asignatura",value_name="Nota")
dfm

   nombre  edad    Asignatura  Nota
0   María    18   Matemáticas   8.5
1    Luis    22   Matemáticas   7.0
2  Carmen    20   Matemáticas   3.5
3   María    18      Economía   8.0
4    Luis    22      Economía   6.5
5  Carmen    20      Economía   5.0
6   María    18  Programación   6.5
7    Luis    22  Programación   4.0
8  Carmen    20  Programación   9.0

In [36]:
dfm.pivot(columns='Asignatura',index='nombre',values='Nota')

Asignatura  Economía  Matemáticas  Programación
nombre
Carmen           5.0          3.5           9.0
Luis             6.5          7.0           4.0
María            8.0          8.5           6.5

In [39]:
dfcol

                             nombre  edad sexo   peso  altura  colesterol
0      José Luis Martínez Izquierdo    18    H   85.0    1.79       182.0
1                    Rosa Díaz Díaz    32    M   65.0    1.73       232.0
2             Javier García Sánchez    24    H    NaN    1.81       191.0
3               Carmen López Pinzón    35    M   65.0    1.70       200.0
4              Marisa López Collado    46    M   51.0    1.58       148.0
5                 Antonio Ruiz Cruz    68    H   66.0    1.74       249.0
6           Antonio Fernández Ocaña    51    H   62.0    1.72       276.0
7             Pilar Martín González    22    M   60.0    1.66         NaN
8              Pedro Gálvez Tenorio    35    H   90.0    1.94       241.0
9           Santiago Reillo Manzano    46    H   75.0    1.85       280.0
10            Macarena Álvarez Luna    53    M   55.0    1.62       262.0
11       José María de la Guía Sanz    58    H   78.0    1.87       198.0
12  Miguel Angel Cuadrado Gutiérrez    27    H  109.0    1.98       210.0
13            Carolina Rubio Moreno    20    M   61.0    1.77       194.0

In [43]:
dfcol.pivot(columns=['sexo'],index='nombre',values=['peso'])

                                  peso
sexo                                 H     M
nombre
Antonio Fernández Ocaña           62.0   NaN
Antonio Ruiz Cruz                 66.0   NaN
Carmen López Pinzón                NaN  65.0
Carolina Rubio Moreno              NaN  61.0
Javier García Sánchez              NaN   NaN
José Luis Martínez Izquierdo      85.0   NaN
José María de la Guía Sanz        78.0   NaN
Macarena Álvarez Luna              NaN  55.0
Marisa López Collado               NaN  51.0
Miguel Angel Cuadrado Gutiérrez  109.0   NaN
Pedro Gálvez Tenorio              90.0   NaN
Pilar Martín González              NaN  60.0
Rosa Díaz Díaz                     NaN  65.0
Santiago Reillo Manzano           75.0   NaN